# Parameter Description Property

Source: https://www.revitapidocs.com/2026/2e258549-0d71-8e2d-56c4-130e890362a3.htm

---

| Parameter Description Property |
| --- |

Returns the tooltip information for a parameter.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public string Description { get; set; }
```

```
Public Property Description As String
	Get
	Set
```

```
public:
property String^ Description {
	String^ get ();
	void set (String^ value);
}
```

```
member Description : string with get, set
```

#### Property Value

String Exceptions

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown if this parameter is built\-in. |

See Also

#### Reference

Parameter Class Autodesk.Revit.DB Namespace